# Core utilities
brew "bat" # A cat clone with syntax highlighting and Git integration
brew "bash-completion@2" # Programmable completion for Bash
brew "coreutils" # GNU core utilities
brew "eza" # Modern replacement for 'ls'
brew "fd" # Simple, fast and user-friendly alternative to 'find'
brew "git" # Version control system
brew "git-extras" # Extra Git utilities and tools
brew "htop" # Interactive process viewer
brew "httpie" # User-friendly command-line HTTP client
brew "jq" # Command-line JSON processor
brew "ripgrep" # Fast search tool like grep
brew "tldr" # Simplified and community-driven man pages
brew "starship" # Cross-shell prompt
brew "stow" # Symlink farm manager for dotfiles
brew "zoxide" # Smart directory jumper
brew "zsh" # Z shell
brew "zsh-completions" # Additional completion definitions for Zsh
brew "zsh-syntax-highlighting" # Syntax highlighting for Zsh
brew "zsh-history-substring-search" # Better history search for Zsh

# Development tools
brew "black" # Python code formatter
brew "gh" # GitHub CLI tool
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "lazygit" # Simple terminal UI for git commands
brew "neovim" # Modern Vim-based text editor
brew "opencode" # Open source AI coding agent
brew "prettier" # Code formatter
brew "shfmt" # Shell script formatter

# Docker
brew "colima" # Container runtimes on MacOS with minimal setup
brew "docker" # Container platform (CLI)
brew "docker-compose" # Define and run multi-container Docker applications

# Productivity tools
cask "ghostty" # Fast GPU-accelerated terminal emulator
cask "raycast" # Productivity app for macOS

# Version manager
brew "asdf"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
